In [1]:
import pandas as pd
import sqlite3

In [2]:
!pip install ipython-sql

Requirement already satisfied: ipython-sql in c:\users\jayka\anaconda3\lib\site-packages (0.4.1)
Requirement already satisfied: prettytable<1 in c:\users\jayka\anaconda3\lib\site-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: ipython-genutils>=0.1.0 in c:\users\jayka\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: ipython>=1.0 in c:\users\jayka\anaconda3\lib\site-packages (from ipython-sql) (7.12.0)
Requirement already satisfied: six in c:\users\jayka\anaconda3\lib\site-packages (from ipython-sql) (1.14.0)
Requirement already satisfied: sqlalchemy>=0.6.7 in c:\users\jayka\anaconda3\lib\site-packages (from ipython-sql) (1.3.13)
Requirement already satisfied: sqlparse in c:\users\jayka\anaconda3\lib\site-packages (from ipython-sql) (0.4.2)
Requirement already satisfied: traitlets>=4.2 in c:\users\jayka\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (4.3.3)
Requirement already satisfied: setuptools>=18.5 in c:\users\jayka\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (45.2.0.post20200210)
Requirement already satisfied: decorator in c:\users\jayka\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (4.4.1)
Requirement already satisfied: backcall in c:\users\jayka\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.1.0)
Requirement already satisfied: jedi>=0.10 in c:\users\jayka\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.14.1)
Requirement already satisfied: colorama; sys_platform == "win32" in c:\users\jayka\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.4.3)
Requirement already satisfied: pygments in c:\users\jayka\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (2.5.2)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\jayka\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (3.0.3)
Requirement already satisfied: pickleshare in c:\users\jayka\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: parso>=0.5.0 in c:\users\jayka\anaconda3\lib\site-packages (from jedi>=0.10->ipython>=1.0->ipython-sql) (0.5.2)
Requirement already satisfied: wcwidth in c:\users\jayka\anaconda3\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.1.8)

In [3]:
df = pd.read_csv('test1.csv')

In [4]:
print(df)

        Name  age  Experience  Salary
0      Krish   31          10   30000
1  Sudhanshu   30           8   25000
2      Sunny   29           4   20000
3       Paul   24           3   20000
4     Harsha   21           1   15000
5    Shubham   23           2   18000

In [6]:
cnn = sqlite3.connect('sql_jpy.db')

In [8]:
df.to_sql('people', cnn)

ValueError: Table 'people' already exists.

In [9]:
%load_ext sql

In [10]:
%sql sqlite:///sql_jpy.db

In [11]:
%%sql

SELECT *
FROM people

 * sqlite:///sql_jpy.db
Done.

[(0, 'Krish', 31, 10, 30000),
 (1, 'Sudhanshu', 30, 8, 25000),
 (2, 'Sunny', 29, 4, 20000),
 (3, 'Paul', 24, 3, 20000),
 (4, 'Harsha', 21, 1, 15000),
 (5, 'Shubham', 23, 2, 18000)]

In [13]:
%%sql

SELECT * FROM people WHERE Salary < 20000

 * sqlite:///sql_jpy.db
Done.

[(4, 'Harsha', 21, 1, 15000), (5, 'Shubham', 23, 2, 18000)]